# -*- coding: utf-8 -*-
"""Products.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1v9Z_ZyEv_6ri-1j94P9VvwwNiIr_udhY
"""

# Приведем список покупок в магазине
shop_list = ['Картофель', 'Горошек', 'Рис', 'Хлеб']
# Измените список согласно пунктам задания
# Выведите результат каждого пункта на консоль по очереди
# а. Вставьте рыбу между горошком и рисом
shop_list.insert(2, 'Рыба')
print(shop_list)
# b. Добавьте фрукты из списка fruits в конец списка shop_list
fruits = ['Яблоко', 'Апельсин', 'Клубника']
shop_list = shop_list + fruits
print(shop_list)
# c. Удалите из списка shop_list картофель
shop_list.remove('Картофель')
print(shop_list)
# d. Какими по счету стоят хлеб и апельсин? Выведите номера на консоль в формате
# Номер "продукта" в списке - N
print('Номер "продукта Хлеб" в списке - ', shop_list.index('Хлеб'))
print('Номер "продукта Апельсин" в списке - ', shop_list.index('Апельсин'))