# -*- coding: utf-8 -*-
"""Task_2_2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1BHYay0HHTvVjKhLR5NjkNCNjDhcsOwGt
"""

# Задача 2.2. 

# Напишите функцию, которая возвращает номер квартал по номеру месяца
# Например: 
# месяц 2 (февраль) является частью первого квартала; 
# месяц 6 (июнь) является частью второго квартала; 
# месяц 11 (ноябрь) является частью четвертого квартала.

def quarter_of(month):
    txt = 'месяц ' + str(month) + ' является частью '
    if month >= 1 and month <= 3:
        quart = txt + 'первого квартала'
    if month >= 4 and month <= 6:
        quart = txt + 'второго квартала'
    if month >= 7 and month <= 9:
        quart = txt + 'третьего квартала'
    if month >= 10 and month <= 12:
        quart = txt + 'четвёртого квартала'
    if month < 1:
        quart = 'Проверьте правильность значения месяца'
    if month > 12:
        quart = 'Проверьте правильность значения месяца'
    return quart

#    pass
print(quarter_of(2))
print(quarter_of(5))
print(quarter_of(9))