# -*- coding: utf-8 -*-
"""Task_1_3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1W4qtegAJb83jJ0QwDKDLAYobzXRfacbl
"""

from traitlets.traitlets import MetaHasTraits
# Задача 1.3.

# Напишите скрипт, который принимает от пользователя номер месяца, 
# а возвращает количество дней в нем.
# Результат проверки вывести на консоль
# Допущение: в феврале 28 дней
# Если номер месяца некорректен - сообщить об этом
my_Year = [
    ['январь', 31],
    ['февраль', 28],
    ['март', 31],
    ['апрель', 30],
    ['май', 31],
    ['июнь', 30],
    ['июль', 31],
    ['август', 31],
    ['сентябрь', 30],
    ['октябрь', 31],
    ['ноябрь', 30],
    ['декабрь', 31]
]
m =int(input('Введите номер месяца: '))
if m >= 13:
  print('Такого месяца нет!')
elif m < 1:
  print('Такого месяца нет!')
else:
  print('Вы ввели ' + my_Year[m - 1] [0] + '.', my_Year[m - 1] [1], 'дней')

# Например,
    # Введите номер месяца: 3
    # Вы ввели март. 31 дней

    # Введите номер месяца: 2
    # Вы ввели февраль. 28 дней

    # Введите номер месяца: 15
    # Такого месяца нет!